Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleProfile
The IFC2X3_ParametricObject_RectangleProfile class contains the rectangular profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleProfile.XDim
The X dimension.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleProfile.YDim
The Y dimension.